/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   exit_utils.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gulee <gulee@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/09/07 21:30:16 by gulee             #+#    #+#             */
/*   Updated: 2022/09/10 19:54:10 by gulee            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../includes/minishell.h"

/**
 * @brief - 이중배열에서 문자열 개수 반환하는 함수
 *
 * @param str - 이중배열
 * @return i - 개수
 */
int	count_string(char **str)
{
	int	i;

	i = 0;
	while (str[i])
		i++;
	return (i);
}
